In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('world_bank_urban_population.csv')

In [3]:
df = pd.DataFrame(data)

In [4]:
df.head(2)

,Series Name,Series Code,Country Name,Country Code,1990 [YR1990],2000 [YR2000],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018],2019 [YR2019]
0,Urban population (% of total population),SP.URB.TOTL.IN.ZS,Afghanistan,AFG,21.177,22.078,23.737,23.948,24.16,24.373,24.587,24.803,25.02,25.25,25.495,..
1,Urban population (% of total population),SP.URB.TOTL.IN.ZS,Albania,ALB,36.428,41.741,52.163,53.247,54.33,55.387,56.423,57.434,58.421,59.383,60.319,..

In [5]:
df.tail(2)

,Series Name,Series Code,Country Name,Country Code,1990 [YR1990],2000 [YR2000],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018],2019 [YR2019]
267,Data from database: World Development Indicators,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
268,Last Updated: 12/20/2019,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269 entries, 0 to 268
Data columns (total 16 columns):
Series Name      266 non-null object
Series Code      264 non-null object
Country Name     264 non-null object
Country Code     264 non-null object
1990 [YR1990]    264 non-null object
2000 [YR2000]    264 non-null object
2010 [YR2010]    264 non-null object
2011 [YR2011]    264 non-null object
2012 [YR2012]    264 non-null object
2013 [YR2013]    264 non-null object
2014 [YR2014]    264 non-null object
2015 [YR2015]    264 non-null object
2016 [YR2016]    264 non-null object
2017 [YR2017]    264 non-null object
2018 [YR2018]    264 non-null object
2019 [YR2019]    264 non-null object
dtypes: object(16)
memory usage: 33.8+ KB

## Creating DataFrame from a dictionary

In [7]:
data1 = {'weekday': ['Monday','Tuesday','Wednesday'],
            'city': ['New York','London','Paris'],
            'visitors': [34,67,23]}

In [8]:
df1 = pd.DataFrame(data1)

In [9]:
df1

     weekday      city  visitors
0     Monday  New York        34
1    Tuesday    London        67
2  Wednesday     Paris        23

## Creating DataFrame from a list of lists

In [10]:
cities = ['New York','London','Paris']

In [11]:
weekday = ['Monday','Tuesday','Wednesday']

In [12]:
visitors = [12,45,23]

In [13]:
list_labels = ['city','day','vistors']

In [14]:
list_cols = [cities, weekday, visitors]

In [15]:
zipped = list(zip(list_labels, list_cols))

In [16]:
print(zipped)

[('city', ['New York', 'London', 'Paris']), ('day', ['Monday', 'Tuesday', 'Wednesday']), ('vistors', [12, 45, 23])]

In [17]:
data2 = dict(zipped)

In [18]:
df2 = pd.DataFrame(data2)

In [19]:
df2

       city        day  vistors
0  New York     Monday       12
1    London    Tuesday       45
2     Paris  Wednesday       23

## Broadcasting value to entire column

In [20]:
df2['fees'] = 0

In [21]:
df2

       city        day  vistors  fees
0  New York     Monday       12     0
1    London    Tuesday       45     0
2     Paris  Wednesday       23     0

Creates a column with the desired value in all the rows.

## Columns and index labels

In [22]:
df2.columns = ['City','Day','Visitor Numbers','Fees']

In [23]:
df2.index = ['A','B','C']

In [24]:
df2

       City        Day  Visitor Numbers  Fees
A  New York     Monday               12     0
B    London    Tuesday               45     0
C     Paris  Wednesday               23     0